#pragma once
#include "Address.h"
#include "ALUHelpers.h"
#include "GlobalDefinitions.h"
#include "Memory.h"
#include "RegisterU8.h"
#include "RegisterU16.h"
#include <functional>
#include <utility>

#define CLOCK_HZ 4194304
#define CLOCK_NS_PER_CYCLE 238
#define CLOCK_CYCLES_PER_MACHINE_CYCLE 4

#define F_NZ 0x00
#define F_Z  0x01
#define F_NC 0x02
#define F_C  0x03

// Official GameBoy Programming Manual v1.1 by Nintendo: https://www.manualslib.com/manual/1627081/Nintendo-Game-Boy.html?page=7#manual
// Opcode table: https://meganesulli.com/generate-gb-opcodes/
// Incomplete but useful docs: https://gekkio.fi/files/gb-docs/gbctr.pdf
class Cpu
{
private:
    // Memory
    Memory* pMemory;

    // Registers
    RegisterU16 BC; // 00
    RegisterU16 DE; // 01
    RegisterU16 HL; // 10
    RegisterU16 SP; // 11 Stack Pointer
    RegisterU16 AF; // Accumulator & Flags
    RegisterU16 PC; // Program Counter

    RegisterU8 B; // 000
    RegisterU8 C; // 001
    RegisterU8 D; // 010
    RegisterU8 E; // 011
    RegisterU8 H; // 100
    RegisterU8 L; // 101
    RegisterU8 A; // 111 Accumulator
    RegisterU8 F; // Flags

	// Interrupt flags
	u8 IME; // Interrupt Master Enable
	u8 IE; // Interrupt Enable
	u8 IF; // Interrupt Flag

	typedef std::function<int()> instruction_t;

	instruction_t opcodes[256];
	instruction_t opcodes_16[256];

	char* opcode_strings[256];
	char* opcode_strings_16[256];

	bool running;

#ifdef _DEBUG
	std::ofstream trace;
#endif

    // Helpers
    int AddCommon(u8 value, bool addCarry);
    int SubCommon(u8 value, bool subCarry);
	bool FlagMatchesCC(u8 cc);
	u8 ReadByte();
	u16 ReadTwoBytes();
	void FormatFlagsString(char* buf, int size);
	void FormatRegisters(char* buf, int n);

#pragma region Instructions
	// Cpu Control									// opcode   (operands) -> M cycles
	int Daa();										// 00100111 -> 1
	int Cpl();										// 00101111 -> 1
	int Nop();                                      // 00000000 -> 1
	int Ccf();										// 00111111 -> 1
	int Scf();										// 00110111 -> 1
